In [2]:
import pandas as pd

In [4]:
q32017 = '2017q3.xlsx'
df1 = pd.read_excel(q32017)
refine1 = refine1 = df1.drop(['Sales\n3Q 2016', 'Median\n3Q 2016', 'Median\nChange'], axis=1)
refine1= refine1.rename(columns={'Sales\n3Q 2017': 'Sales Q3 2017', 'Median\nQ3 2017': 'Median Q3 2017'})
refine1

               City          Suburb  Sales Q3 2017  Median\n3Q 2017
0          ADELAIDE        ADELAIDE            4.0         695000.0
1          ADELAIDE  NORTH ADELAIDE            9.0        1375000.0
2    ADELAIDE HILLS         ALDGATE           12.0         735000.0
3    ADELAIDE HILLS          ASHTON            NaN              NaN
4    ADELAIDE HILLS    BASKET RANGE            1.0         488000.0
..              ...             ...            ...              ...
473    WEST TORRENS       THEBARTON            2.0         536250.0
474    WEST TORRENS    TORRENSVILLE            8.0         525000.0
475    WEST TORRENS       UNDERDALE            7.0         565000.0
476    WEST TORRENS      WEST BEACH           14.0         770000.0
477    WEST TORRENS   WEST RICHMOND            4.0         379500.0

[478 rows x 4 columns]

In [5]:
q42017 = "2017q4.xlsx"
df2 = pd.read_excel(q42017)
refine2 = df2.drop(['Sales\n4Q 2016', 'Median\n4Q 2016', 'Median\nChange'], axis=1)
refine2 = refine2.rename(columns={'Sales\n4Q 2017':'Sales Q4 2017', 'Median\n4Q 2017': 'Median Q4 2017'})
refine2

               City          Suburb  Sales Q4 2017  Median Q4 2017
0          ADELAIDE        ADELAIDE            6.0        780500.0
1          ADELAIDE  NORTH ADELAIDE            5.0       1095000.0
2    ADELAIDE HILLS         ALDGATE           10.0        675000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
474    WEST TORRENS       THEBARTON            6.0        588650.0
475    WEST TORRENS    TORRENSVILLE           10.0        635000.0
476    WEST TORRENS       UNDERDALE            8.0        650000.0
477    WEST TORRENS      WEST BEACH            8.0        712500.0
478    WEST TORRENS   WEST RICHMOND            2.0        495000.0

[479 rows x 4 columns]

In [6]:
q12018 = "2018q1.xlsx"
df3 = pd.read_excel(q12018)
refine3 = df3.drop(['Sales\n1Q 2017', 'Median\n1Q 2017', 'Median\nChange'], axis=1)
refine3 = refine3.rename(columns={'Sales\n1Q 2018':'Sales Q1 2018', 'Median\n1Q 2018': 'Median Q1 2018'})
refine3

               City          Suburb  Sales Q1 2018  Median Q1 2018
0          ADELAIDE        ADELAIDE            5.0        861000.0
1          ADELAIDE  NORTH ADELAIDE            2.0       2195500.0
2    ADELAIDE HILLS         ALDGATE           17.0        696000.0
3    ADELAIDE HILLS          ASHTON            3.0        681200.0
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
474    WEST TORRENS       THEBARTON            4.0        560000.0
475    WEST TORRENS    TORRENSVILLE           15.0        545000.0
476    WEST TORRENS       UNDERDALE            8.0        610500.0
477    WEST TORRENS      WEST BEACH           13.0        691250.0
478    WEST TORRENS   WEST RICHMOND            7.0        430000.0

[479 rows x 4 columns]

In [7]:
q22018 = '2018q2.xlsx'
df4 = pd.read_excel(q22018)
refine4 = df4.drop(['Sales\n2Q 2017', 'Median\n2Q 2017', 'Median\nChange'], axis=1)
refine4 = refine4.rename(columns={'Sales\n2Q 2018': 'Sales Q2 2018', 'Median\n2Q 2018': 'Median Q2 2018'})
refine4

               City          Suburb  Sales Q2 2018  Median Q2 2018
0          ADELAIDE        ADELAIDE            5.0        696000.0
1          ADELAIDE  NORTH ADELAIDE            6.0       1510000.0
2    ADELAIDE HILLS         ALDGATE           15.0        820000.0
3    ADELAIDE HILLS          ASHTON            1.0        505000.0
4    ADELAIDE HILLS    BASKET RANGE            1.0        532500.0
..              ...             ...            ...             ...
474    WEST TORRENS       THEBARTON            3.0        510000.0
475    WEST TORRENS    TORRENSVILLE           10.0        552500.0
476    WEST TORRENS       UNDERDALE            8.0        627500.0
477    WEST TORRENS      WEST BEACH           12.0        706250.0
478    WEST TORRENS   WEST RICHMOND            2.0        450500.0

[479 rows x 4 columns]

In [8]:
merged1 = pd.merge(refine1,refine2)
merged2 = pd.merge(refine3,refine4)
final = pd.merge(merged1,merged2)
final = final.dropna(how='any')
final

,City,Suburb,Sales Q3 2017,Median\n3Q 2017,Sales Q4 2017,Median Q4 2017,Sales Q1 2018,Median Q1 2018,Sales Q2 2018,Median Q2 2018
0,ADELAIDE,ADELAIDE,4.0,695000.0,6.0,780500.0,5.0,861000.0,5.0,696000.0
1,ADELAIDE,NORTH ADELAIDE,9.0,1375000.0,5.0,1095000.0,2.0,2195500.0,6.0,1510000.0
2,ADELAIDE HILLS,ALDGATE,12.0,735000.0,10.0,675000.0,17.0,696000.0,15.0,820000.0
5,ADELAIDE HILLS,BELAIR,21.0,613000.0,14.0,570000.0,14.0,585000.0,14.0,577500.0
7,ADELAIDE HILLS,BRIDGEWATER,24.0,465000.0,18.0,448000.0,18.0,490000.0,19.0,535000.0
...,...,...,...,...,...,...,...,...,...,...
473,WEST TORRENS,THEBARTON,2.0,536250.0,6.0,588650.0,4.0,560000.0,3.0,510000.0
474,WEST TORRENS,TORRENSVILLE,8.0,525000.0,10.0,635000.0,15.0,545000.0,10.0,552500.0
475,WEST TORRENS,UNDERDALE,7.0,565000.0,8.0,650000.0,8.0,610500.0,8.0,627500.0
476,WEST TORRENS,WEST BEACH,14.0,770000.0,8.0,712500.0,13.0,691250.0,12.0,706250.0
477,WEST TORRENS,WEST RICHMOND,4.0,379500.0,2.0,495000.0,7.0,430000.0,2.0,450500.0

In [10]:
final.to_csv("y17_18_house.csv")